## Staging: alb
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  RESOURCE                                   |
|--------|-----------------------------------------------------------------------------|
| add    | `aws_acm_certificate.blawx_certificate`                                     |
|        | `aws_acm_certificate_validation.blawx_certificate`                          |
|        | `aws_lb.blawx_alb`                                                          |
|        | `aws_lb_listener.blawx_https_listener`                                      |
|        | `aws_lb_target_group.blawx_app`                                             |
|        | `aws_route53_record.blawx_app`                                              |
|        | `aws_route53_record.blawx_certificate_validation[&quot;*.blawx.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.blawx_certificate_validation[&quot;blawx.cdssandbox.xyz&quot;]`   |
|        | `aws_security_group.blawx_alb`                                              |

| CHANGE |         OUTPUT          |
|--------|-------------------------|
| add    | `route53_record_fqdn`   |
|        | `route53_record_name`   |
|        | `target_group_arn`      |
|        | `alb_dns_name`          |
|        | `alb_security_group_id` |
|        | `alb_zone_id`           |
|        | `https_listener_arn`    |
|        | `alb_arn`               |
|        | `certificate_arn`       |
|        | `target_group_name`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.blawx_certificate will be created
  + resource "aws_acm_certificate" "blawx_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "blawx.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.blawx.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "blawx.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + region                    = "ca-central-1"
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.blawx.cdssandbox.xyz",
          + "blawx.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "blawx-staging"
        }
      + tags_all                  = {
          + "CostCentre" = "blawx-staging"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.blawx_certificate will be created
  + resource "aws_acm_certificate_validation" "blawx_certificate" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + region                  = "ca-central-1"
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb.blawx_alb will be created
  + resource "aws_lb" "blawx_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "blawx-staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "ca-central-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-111111111",
          + "subnet-222222222",
        ]
      + tags                                                         = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-alb"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-alb"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.blawx_https_listener will be created
  + resource "aws_lb_listener" "blawx_https_listener" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + region                                                                = "ca-central-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-3-FIPS-2023-04"
      + tags                                                                  = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-https-listener"
          + "Terraform"  = "true"
        }
      + tags_all                                                              = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-https-listener"
          + "Terraform"  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.blawx_app will be created
  + resource "aws_lb_target_group" "blawx_app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "blawx-staging-app-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "ca-central-1"
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-app-target-group"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-app-target-group"
          + "Terraform"  = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-123456789"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.blawx_app will be created
  + resource "aws_route53_record" "blawx_app" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "blawx.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z1234567890ABC"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.blawx_certificate_validation["*.blawx.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "blawx_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1234567890ABC"
    }

  # aws_route53_record.blawx_certificate_validation["blawx.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "blawx_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z1234567890ABC"
    }

  # aws_security_group.blawx_alb will be created
  + resource "aws_security_group" "blawx_alb" {
      + arn                    = (known after apply)
      + description            = "Security group for blawx staging Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Outbound traffic to port 8000"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "blawx-staging-alb-sg"
      + owner_id               = (known after apply)
      + region                 = "ca-central-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-alb-sg"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-alb-sg"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-123456789"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_arn               = (known after apply)
  + alb_dns_name          = (known after apply)
  + alb_security_group_id = (known after apply)
  + alb_zone_id           = (known after apply)
  + certificate_arn       = (known after apply)
  + https_listener_arn    = (known after apply)
  + route53_record_fqdn   = (known after apply)
  + route53_record_name   = "blawx.cdssandbox.xyz"
  + target_group_arn      = (known after apply)
  + target_group_name     = "blawx-staging-app-tg"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.blawx_certificate"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
